In [1]:
import numpy as np
import pandas as pd

In [2]:
sample = {
    "Name" : ["Pravallika", "Mahesh", "Mahesh", "Arjun", "Keerthana", "Pallavi", "Nagarjuna", "Ravi Teja", "Ravi Teja"],
    "Profession" : ["Student", "Actor", "Super Star", np.nan, "Student", "Teacher", "Dancer", "Actor", "Actor"],
    "Age" : [20, np.nan, 45, 55, 22, 35, np.nan, 38, 38]
}

temp = pd.DataFrame(sample)

display(temp)

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0
8   Ravi Teja       Actor  38.0

In [3]:
temp.dropna()

         Name  Profession   Age
0  Pravallika     Student  20.0
2      Mahesh  Super Star  45.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
7   Ravi Teja       Actor  38.0
8   Ravi Teja       Actor  38.0

In [4]:
temp.dropna().reset_index(drop=True)

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh  Super Star  45.0
2   Keerthana     Student  22.0
3     Pallavi     Teacher  35.0
4   Ravi Teja       Actor  38.0
5   Ravi Teja       Actor  38.0

In [5]:
temp.dropna(subset=["Profession"])

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0
8   Ravi Teja       Actor  38.0

In [6]:
temp

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0
8   Ravi Teja       Actor  38.0

In [7]:
temp.drop_duplicates()

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0

In [8]:
temp

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0
8   Ravi Teja       Actor  38.0

In [9]:
temp.drop_duplicates(inplace=True)

temp

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0

In [10]:
temp.sort_values(by="Name")

         Name  Profession   Age
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
6   Nagarjuna      Dancer   NaN
5     Pallavi     Teacher  35.0
0  Pravallika     Student  20.0
7   Ravi Teja       Actor  38.0

In [11]:
temp.sort_values(by="Name").reset_index(drop=True)

         Name  Profession   Age
0       Arjun         NaN  55.0
1   Keerthana     Student  22.0
2      Mahesh       Actor   NaN
3      Mahesh  Super Star  45.0
4   Nagarjuna      Dancer   NaN
5     Pallavi     Teacher  35.0
6  Pravallika     Student  20.0
7   Ravi Teja       Actor  38.0

In [12]:
temp.groupby(temp["Profession"])["Age"].mean()

Profession
Actor         38.0
Dancer         NaN
Student       21.0
Super Star    45.0
Teacher       35.0
Name: Age, dtype: float64

In [13]:
temp.groupby(temp["Profession"])["Age"].min()

Profession
Actor         38.0
Dancer         NaN
Student       20.0
Super Star    45.0
Teacher       35.0
Name: Age, dtype: float64

In [14]:
temp.groupby(temp["Profession"])["Age"].max()

Profession
Actor         38.0
Dancer         NaN
Student       22.0
Super Star    45.0
Teacher       35.0
Name: Age, dtype: float64

In [15]:
temp

         Name  Profession   Age
0  Pravallika     Student  20.0
1      Mahesh       Actor   NaN
2      Mahesh  Super Star  45.0
3       Arjun         NaN  55.0
4   Keerthana     Student  22.0
5     Pallavi     Teacher  35.0
6   Nagarjuna      Dancer   NaN
7   Ravi Teja       Actor  38.0

In [16]:
temp.T

,0,1,2,3,4,5,6,7
Name,Pravallika,Mahesh,Mahesh,Arjun,Keerthana,Pallavi,Nagarjuna,Ravi Teja
Profession,Student,Actor,Super Star,NaN,Student,Teacher,Dancer,Actor
Age,20.0,NaN,45.0,55.0,22.0,35.0,NaN,38.0